questiones = []
class Question():
    def __init__(self, text, false1 ,true , false2, false3):
        self.text = text
        self.true = true
        self.false1 = false1
        self.false2 = false2
        self.false3 = false3
        questiones.append(self)

    def show_questione(self, lb, rbtns):
        rbtns[0].setText(self.false1)
        rbtns[1].setText(self.true)
        rbtns[2].setText(self.false2)
        rbtns[3].setText(self.false3)
        lb.setText(self.text)




Question('В якому році розпочалася 1 світова війна?', '1914', '1918', '1941', '1939' )
Question('В якому році розпочалася 2 світова війна?', '1939', '1941', '1951' , '1888')
Question('В якому році розпочалася 100 літня війна?', '1914', '1337', '1480' , '1777')
Question('В якому місяці літні канікули починаються??', 'березень', 'червень', 'квітень', 'вересень' )
Question('В якому місті знаходиться столиця України?', 'Обухів', 'Київ', 'Місто', 'Москва' )
Question('В якій будівлі лікують людей?', 'пожежна станція', 'лікарня', 'спальня' , 'ні де)')
Question('В якому році створено цей тест?', '1914', '2024', '2000' , '1777')
Question('В якому житті ми живемо?', 'що?', 'першому', '1', '1918' )
Question('Який будинок називається (Хрущовка)?', 'багато поверхівка', '5-ти поверзівка', 'одно поверховий будинок', '1' )
Question('Коли ми спимо?', 'вдень', 'вночі', 'ввечері' , 'вранці')
Question('2+2*2?', '8', '6', '4' , 'шо це')
Question('Що створює кисень?', 'ми', 'рослинність', 'місяць', 'магія' )
Question('Де живуть депутати Порошенка?', 'В Україні', 'на мальдівах', 'дома', 'в раші' )
Question('Чи існуємо ми?', 'ні', 'так', 'ні защо!' , 'чому?')
Question('Хто такі люди?', 'люди', 'живі істоти класу ссавців', 'ми' , 'не ми')
Question('Чому люди дурні?', 'МИ РОЗУМНІ!', 'бо свторили ШІ', 'а чому?', 'емм... ні' )
Question('Як ми спимо?', 'сидячи', 'в стані сну', 'стоячи', 'лежачи' )
Question('Коли ми спинилися?', 'ем..?', 'вчора', 'ніколи' , 'завтра')
Question('Як називаеться планета Земля?', 'ЩО', 'Земля', 'terra ' , 'планета')
Question('(4+4)*4', '20', '32', '0', 'в другий раз це не спрацює!' )
